//
//  Question.swift
//  WorkCharacterTestAPP
//
//  Created by 姜又寧 on 2021/12/19.
//

import Foundation

let qustion : [String] = [
    "1. 明天將會出現百年一遇的流星雨，你的反應是⋯⋯",
    "2. 你多久才逛1次百貨公司？",
    "3. 你喜歡聽什麼歌?",
    "4. 你會在私家車上額外加鎖嗎？",
    "5. 你空閒時會去散步嗎？",
    "6. 你平均每天上班要花多久？",
    "7. 早上起來，你會否不想上班？",
    "8. 你有養寵物嗎？",
    "9. 在1座高樓大廈裏租1層來工作，你想租哪層？",
    "10. 洗澡時，你先洗哪裡？"
]

let answer : [Int : [String]] = [
    1 : ["A. 沒有興趣，連有關報道都不想看 （1分）", "B. 少少興趣，但看看相片、影片就夠 （3分）", "C. 那麼難得，當然要親眼看看 （5分"],
    2 : ["A. 幾年沒去過 （1分）", "B. 路過時可能會逛逛 （3分）", "C. 沒事做就會去逛 （5分）"],
    3 : ["A.只喜歡聽某種類型的歌 （1分）", "B. 憑感覺，有些歌一聽就愛上 （3分）", "C. 很多歌都要聽幾次才會喜歡 （5分）"],
    4 : ["A. 會多加幾個鎖 （1分）", "B. 會多加1個安全鎖 （3分）", "C. 不會另外加鎖，只用基本的1個 （5分）"],
    5 : ["A. 大多數只在家附近兜圈 （1分）", "B. 會去離家比較遠以及平常比較少去的地方 （3分）", "C. 會去從來沒去過的地方 （5分）"],
    6 : ["A.10分鐘內 （1分）", "B. 10－30分鐘左右 （3分）", "C. 30分鐘以上 （5分）"],
    7 : ["A.難免會有，但不多 （1分）", "B. 常會，看當天的心情 （3分）", "C. 只有天氣差才會 （5分）"],
    8 : ["A. 有，而且超級喜歡 （1分）", "B. 有，但會覺得某些小事情很麻煩 （3分）", "C. 沒有 （5分）"],
    9 : ["A. 偏高層，比較少人會到，而且視野較難被其他大廈阻擋 （1分）", "B. 最高層，喜歡在頂點的感覺 （3分）", "C. 偏低層，出入比較快 （5分）"],
    10 : ["A.臉 （1分）", "B. 胸部 （3分）", "C. 私密部位 （5分）"],
]

let toResolve : [String] = [
    "強烈的責任心是你的優勢，你會盡100％的努力將委派給你的工作做到最好。工作中的你非常專注，是個很盡責的員工！因此，你只要執着地做1件事，尤其是深入研究自己感興趣、喜歡的事，就可以輕易取得成功。但要留意除了工作之外，也要多出去走走，參加公司活動，加強人際關係。",
    "簡單點來說，你很「識玩」。你深知如何避重就輕，亦很會包裝自己的形象，這樣可以掩飾工作能力上的一些小不足。人脈網絡強勁、與同事關係融洽是你的優勢，亦是你成功的主因。但當然，工作表現亦要有不錯的水平，上司才會更加欣賞你。除了做「打工仔」外，你也很適合自己做老闆，應該可以有一番作為。",
    "你是個很有想法的人，亦喜歡表達自己的想法，然而總是得不到認同，而你亦不知道問題出在哪裏。勇於表達是你的優勢，但平時需要多做一點「課外功課」，對這個社會及世界多點了解，打好功底才會成功。"
]
